## Analysing the impact of temperature on crop yield 
Done by Nicholas Dale (falconpunch082)

Objective: To determine how temperature impacts crop yield of different crops
            by creating a DataFrame containing relevant columns and then
            creating a scatter plot of temperature vs crop yield for each
            unique crop in the dataset.

In [1]:
# Creating dependencies for setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
from pathlib import Path

**Data Synthesis and Cleanup**
- crop_yield.csv has a lot of columns, but does not have an annual temperature column.
- TEMP_ANNUAL_SEASONAL_MEAN.csv contains information of annual temperature of the ENTIERTY of India.
- We will create new DataFrames specially designed to answer the relationship between temperature and crop yield for each crop by taking the columns of 'crop' and 'crop_year' from crop_yield.csv.
- While states are provided, there are no free sources of annual temperature of each Indian state by year. Therefore, one limitation in analysing this data would be the generalisation of temperature when India actually has different climates within its borders.

In [2]:
# Creating file paths for each .csv file
crop_csv = Path("resources/crop_yield.csv")
temp_csv = Path("resources/TEMP_ANNUAL_SEASONAL_MEAN.csv")

# Creating DataFrames from each .csv file
crop = pd.read_csv(crop_csv)
temp = pd.read_csv(temp_csv)

# removing any results from both DataFrames that contain null values
crop.dropna(how='any')
temp.dropna(how='any')

       YEAR ANNUAL JAN-FEB MAR-MAY JUN-SEP OCT-DEC
0    1901.0  25.42   20.11   27.64   28.16    23.1
1    1902.0  25.42   20.88   27.96   27.98   22.51
2    1903.0  25.01   19.99   27.02      28   22.33
3    1904.0  24.93   19.76   27.23   27.57   22.56
4    1905.0  24.84   18.36   26.38    28.2   23.13
..      ...    ...     ...     ...     ...     ...
116  2017.0  26.04   21.37    28.2   28.39   23.84
117  2018.0   25.9   21.24   28.16   28.28   23.55
118  2019.0  25.86   20.71      28    28.6   23.49
119  2020.0  25.78   20.79   27.58   28.45   23.75
120  2021.0  25.93   21.43   27.97   28.36   23.66

[121 rows x 6 columns]

In [3]:
# Previewing crop DataFrame
crop.head()

,Crop,Crop_Year,Season,State,Area,Production,Annual_Rainfall,Fertilizer,Pesticide,Yield
0,Arecanut,1997,Whole Year,Assam,73814.0,56708,2051.4,7024878.38,22882.34,0.796087
1,Arhar/Tur,1997,Kharif,Assam,6637.0,4685,2051.4,631643.29,2057.47,0.710435
2,Castor seed,1997,Kharif,Assam,796.0,22,2051.4,75755.32,246.76,0.238333
3,Coconut,1997,Whole Year,Assam,19656.0,126905000,2051.4,1870661.52,6093.36,5238.051739
4,Cotton(lint),1997,Kharif,Assam,1739.0,794,2051.4,165500.63,539.09,0.420909

In [4]:
# Previewing temp DataFrame
temp.head()

     YEAR ANNUAL JAN-FEB MAR-MAY JUN-SEP OCT-DEC
0  1901.0  25.42   20.11   27.64   28.16    23.1
1  1902.0  25.42   20.88   27.96   27.98   22.51
2  1903.0  25.01   19.99   27.02      28   22.33
3  1904.0  24.93   19.76   27.23   27.57   22.56
4  1905.0  24.84   18.36   26.38    28.2   23.13

In [5]:
# Picking out relevant columns
crop_cleaned = crop[['Crop', 'Crop_Year', 'Area', 'Production', 'Yield']]
crop_cleaned = crop_cleaned.rename({'Crop_Year': 'Year'}, axis='columns')
crop_cleaned.head()

# Description of variables:
# - Crop: name of crop cultivated
# - Year: year in which crop was grown
# - Area: total land area in hectares under cultivation
# - Production: quantity of crop production in metric tons
# - Yield : production/area

           Crop  Year     Area  Production        Yield
0      Arecanut  1997  73814.0       56708     0.796087
1     Arhar/Tur  1997   6637.0        4685     0.710435
2   Castor seed  1997    796.0          22     0.238333
3      Coconut   1997  19656.0   126905000  5238.051739
4  Cotton(lint)  1997   1739.0         794     0.420909

In [6]:
# The plan now is to create multiple DataFrames based on the 5 most produced crops.
# This analysis will thus only focus on rice, maize, moong, ruad and groundnut crops.
crop_cleaned['Crop'].value_counts()

Rice                     1197
Maize                     975
Moong(Green Gram)         740
Urad                      733
Groundnut                 725
Sesamum                   685
Potato                    628
Sugarcane                 605
Wheat                     545
Rapeseed &Mustard         528
Bajra                     524
Jowar                     513
Arhar/Tur                 508
Ragi                      498
Gram                      490
Small millets             485
Cotton(lint)              476
Onion                     454
Sunflower                 441
Dry chillies              419
Other Kharif pulses       382
Horse-gram                371
Peas & beans (Pulses)     369
Tobacco                   364
Other  Rabi pulses        355
Soyabean                  349
Turmeric                  337
Masoor                    324
Ginger                    323
Linseed                   308
Castor seed               300
Barley                    297
Sweet potato              273
Garlic                    250
Banana                    245
Mesta                     210
Tapioca                   201
Coriander                 199
Niger seed                192
Jute                      181
Coconut                   172
Safflower                 169
Arecanut                  162
Sannhamp                  160
Other Cereals             146
Cowpea(Lobia)             134
Cashewnut                 134
Black pepper              126
other oilseeds            126
Moth                      110
Khesari                    75
Cardamom                   74
Guar seed                  63
Oilseeds total             29
Other Summer Pulses        10
Name: Crop, dtype: int64

In [7]:
# creating DataFrames grouped by crop
wanted = ['Rice', 'Maize', 'Moong(Green Gram)', 'Urad', 'Groundnut']

rice = crop_cleaned[crop_cleaned['Crop'] == 'Rice']
maize = crop_cleaned[crop_cleaned['Crop'] == 'Maize']
moong = crop_cleaned[crop_cleaned['Crop'] == 'Moong(Green Gram)']
urad = crop_cleaned[crop_cleaned['Crop'] == 'Urad']
groundnut = crop_cleaned[crop_cleaned['Crop'] == 'Groundnut']

rice = rice.groupby(['Year']).sum().reset_index()
maize = maize.groupby(['Year']).sum().reset_index()
moong = moong.groupby(['Year']).sum().reset_index()
urad = urad.groupby(['Year']).sum().reset_index()
groundnut = groundnut.groupby(['Year']).sum().reset_index()

C:\Users\dalet\AppData\Local\Temp\ipykernel_16904\1783633807.py:10: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  rice = rice.groupby(['Year']).sum().reset_index()
C:\Users\dalet\AppData\Local\Temp\ipykernel_16904\1783633807.py:11: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  maize = maize.groupby(['Year']).sum().reset_index()
C:\Users\dalet\AppData\Local\Temp\ipykernel_16904\1783633807.py:12: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  moong = moong.groupby(['Year']).sum().reset_index()
C:\Users\dalet\AppData\Local\Temp\ipykernel_16904\1783633807.py:13: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  urad = urad.groupby(['Year']).sum().reset_index()
C:\Users\dalet\AppData\Local\Temp\ipykernel_16904\1783633807.py:14: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  groundnut = groundnut.groupby(['Year']).sum().reset_index()

In [17]:
# Only taking annual temperature
temp_a = temp[['YEAR', 'ANNUAL']]

# Converting temp['YEAR'] into int to match crop_cleaned['Year']
temp_a = temp_a.fillna(value=0)
temp_a['YEAR'] = temp_a['YEAR'].astype(int)

temp_a = temp_a.rename({'YEAR': 'Year','ANNUAL': 'Annual Temp'}, axis='columns')

# Previewing temp DataFrame to see if change has occured
temp_a.head()

   Year Annual Temp
0  1901       25.42
1  1902       25.42
2  1903       25.01
3  1904       24.93
4  1905       24.84

In [18]:
# Merging created crop DataFrames with temp DataFrame
rice_temp = rice.merge(temp_a, on='Year')
maize_temp = maize.merge(temp_a, on='Year')
moong_temp = moong.merge(temp_a, on='Year')
urad_temp = urad.merge(temp_a, on='Year')
groundnut_temp = groundnut.merge(temp_a, on='Year')

In [19]:
rice_temp.head()

   Year        Area  Production      Yield Annual Temp
0  1997  30082643.0    61127362  64.012599       25.35
1  1998  43724135.0    82832220  88.176505       25.72
2  1999  40988027.0    83227420  81.999153       25.57
3  2000  43061434.0    83029329  93.414176       25.53
4  2001  42633509.0    89957788  90.345981        25.6

In [21]:
maize_temp.head()

   Year       Area  Production        Yield Annual Temp
0  1997  4882848.0     8810504  1044.295066       25.35
1  1998  4895988.0     9312283    56.422911       25.72
2  1999  5542914.0    10604929    57.361891       25.57
3  2000  5587217.0    10961556    62.531353       25.53
4  2001  5339202.0    11194000    65.168461        25.6

In [22]:
moong_temp.head()

   Year        Area  Production      Yield Annual Temp
0  1997  1424493.00      536008   4.292316       25.35
1  1998  2210760.00      951073   7.926506       25.72
2  1999  2692895.00     1163678  10.523782       25.57
3  2000  2523547.00      951385  11.622644       25.53
4  2001  2112018.27      760419  12.752542        25.6

In [23]:
urad_temp.head()

   Year       Area  Production      Yield Annual Temp
0  1997  1802652.0      785671   7.090675       25.35
1  1998  2155362.0     1106135   8.913467       25.72
2  1999  3073278.0     1403252  11.087844       25.57
3  2000  2618695.0     1218233   9.418268       25.53
4  2001  2629306.0     1237943  12.019942        25.6

In [24]:
groundnut_temp.head()

   Year       Area  Production      Yield Annual Temp
0  1997  5321839.0     5003168  20.583891       25.35
1  1998  7309299.0     9035098  27.904968       25.72
2  1999  6797635.0     5424271  29.851160       25.57
3  2000  6483421.0     6318364  28.544469       25.53
4  2001  5988911.0     6720962  28.686920        25.6